#ifndef __AHT21_I2C_H
#define __AHT21_I2C_H

#include "STC8G_H_I2C.h"

//========================================================================
// AHT21 i2c Write Addresses
//========================================================================
#define AHT21_ADDR 0x70 // IIC addr

//========================================================================
// AHT21 状态位宏定义及函数定义
//========================================================================
#define AHT21_STATUS_CAL_OVER 0x08 // 校准使能OK bit 0: 未校准 1: 已校准

void AHT21_Init(void); // 初始化函数

//========================================================================
// AHT21 测量、数据读取宏定义及函数声明
//========================================================================
#define AHT21_STATUS_BUSY 0x80 // 忙位 0: 空闲 1: 忙

typedef struct
{
    u8 Humi;  // 湿度
    i8 Temp;  // 温度
} AHT21_DATA; // AHT21数据结构

void AHT21_Measure(void);              // 测量函数
void AHT21_Read_Data(AHT21_DATA *R_T); // 读取数据函数

#endif